docs/phase-1-results/k6-normal-load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/scripts/order-flow.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
smoke   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
smoke   [ 100% ] 1 VUs  10.0s/10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=36.49ms

    http_req_failed
    ✓ 'rate<0.1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30      2.859173/s
    checks_succeeded...: 100.00% 30 out of 30
    checks_failed......: 0.00%   0 out of 30

    ✓ products 200
    ✓ product detail 200
    ✓ order created

    HTTP
    http_req_duration..............: avg=15.87ms min=3.43ms med=10.29ms max=45.24ms p(90)=33.74ms p(95)=36.49ms p(99)=43.29ms
      { expected_response:true }...: avg=15.87ms min=3.43ms med=10.29ms max=45.24ms p(90)=33.74ms p(95)=36.49ms p(99)=43.29ms
    http_req_failed................: 0.00%  0 out of 30
    http_reqs......................: 30     2.859173/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1.03s  med=1.04s   max=1.06s   p(90)=1.06s   p(95)=1.06s   p(99)=1.06s  
    iterations.....................: 10     0.953058/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 38 kB  3.6 kB/s
    data_sent......................: 6.0 kB 575 B/s



running (10.5s), 0/1 VUs, 10 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  10s